{"type":"data","nodes":[null,{"type":"data","data":[{"repoDetails":1,"readme":23,"meta":24},{"id":2,"name":3,"user":4,"url":5,"description":6,"isFork":7,"createdAt":8,"updatedAt":9,"homepage":10,"language":11,"license":12,"size":13,"stars":14,"forks":15,"issues":16,"topics":17,"archived":7,"has_pages":7},649129086,"OLD_AdGuardian-Term","Lissy93","https://github.com/Lissy93/OLD_AdGuardian-Term","Go Lang CLI app for monitoring AdGuard traffic | See Rust version at: https://github.com/Lissy93/AdGuardian-Term",false,"2023-06-03T21:50:28Z","2024-08-12T14:39:32Z","https://adguardian.as93.net","Go","",40,8,1,0,[18,19,20,21,22],"adguard","fail","golang","terminal","tui","\u003Ch1 align=\"center\">AdGuardian-Term (Go Version)\u003C/h1>\n\u003Cp align=\"center\">\n\t\u003Ci>Real-time terminal monitoring & stats for AdGuard Home\u003C/i>\u003Cbr>\n\t\u003Cb>ðŸŒ \u003Ca href=\"https://adguardian.as93.net/\">adguardian.as93.net\u003C/a>\u003C/b>\u003Cbr>\n\t\u003Cimg width=\"128\" src=\"https://i.ibb.co/9phhMWP/adguardian-go.png\" />\u003Cbr>\n\u003C/p>\n\n## About\n\n\u003Cimg align=\"right\" width=\"460\" src=\"https://i.ibb.co/BykbdjF/Screenshot-from-2023-06-03-22-57-07.png\" >\n\n> [!NOTE]\n> This app has now been re-written in Rust \u003Ca href=\"https://github.com/Lissy93/AdGuardian-Term\">\u003Cimg align=\"right\" width=\"110\" src=\"https://adguardian.as93.net/images/ferris.png\" />\u003C/a>\u003Cbr>\n> See **[Lissy93/AdGuardian-Term](https://github.com/Lissy93/AdGuardian-Term)** instead!\n\nMy purpose for uploading this (failed) project is to show that not everything goes according to plan, and that's okay - it's just part of the learning process!\nI've written more about my learnings in the [Background & Lessons Learned](#background--lessons-learned) section below.\n\nAlthough now re-written, this app is still fully functional, and pretty much feature complete.\nIf you wish to continue, see the [usage](#usage) instructions for development and deployment docs.\n\n\u003Cbr>\n\n---\n\n## Background & Lessons Learned\n\nInitially, I chose Go, because it's quite performant, has a neat concurrency model, is reasonably quick to write, and (most importantly) compiles into a tidy single binary. I'd also come across the gizak/termui package, which seemed to be the perfect choice for plotting the charts.\n\nHowever, I found Go's memory safety to be less than ideal. The compiler was irritating and managing threads manually was difficult. I also came across an issue which, for the life of me, I could not resolve - when termui updated the screen, random characters from the previous view would remain, making the charts hard for the user to read.\n\nAfter spending nearly an entire weekend building out this project, I arrived at the tough realization that I had probably chosen the wrong tech stack. I was initially reluctant to scrap everything I had written so far, but it was the best way forward.\n\nInstead, I picked up Rust - a language I'd been curious about but hadn't found the right opportunity to dive into. Rust, much like Go, is fast and efficient, but with one key difference - it emphasizes safety and manages memory exceptionally well. Rust also compiles into a single binary and has a robust concurrency model. In short, it seemed to address many of the issues I had encountered with Go.\n\nRebuilding my app in Rust wasn't a walk in the park, though. It has a steep learning curve and some unique concepts, like ownership and borrowing, which took a while to wrap my head around. Nevertheless, the more I delved into it, the more I found myself appreciating its design. In particular, its ability to prevent common programming errors, like null pointer dereferencing and data races, was a huge win for me.\n\n**As developers, we need to remind ourselves that it's okay to take a step back, reassess our decisions, and change our course if necessary. After all, in the long run, it's not about how quickly we can finish a project but about how well we can adapt, learn, and grow along the way. That's how we build not just better software, but also become better developers.**\n\nThe new project is uploaded here:\n\n[![Lissy93/AdGuardian-Term - GitHub](https://gh-card.dev/repos/Lissy93/AdGuardian-Term.svg?fullname=)](https://github.com/Lissy93/AdGuardian-Term)\n\n\n---\n\n## Usage\n\n### Prerequisites\nIf you haven't already done so, you'll need to [install Go Lang](https://go.dev/doc/install).\u003Cbr>\nThen clone the repo `git clone https://github.com/Lissy93/OLD_AdGuardian-Term.git && cd OLD_AdGuardian-Term`\n\n### Developing\nRun `go run .` to start the app\n\n### Deploying\nRun `go build` to generate the executable for your system.\u003Cbr>\nYou can then launch that with `./adguardian-term`\n\n### Docker\nThere's also a Dockerfile, although the image is not published to any registry.\u003Cbr>\nThis can be built with: `docker build -t adguardian .`\u003Cbr>\nAnd then run, with: `docker run adguardian`\n\n### Configuring\nThe app requires details of your AdGuard Home instance (endpoint and credentials).\nI didn't get round to making these parameters into environmental variables.\nSo currently you'll need to set them in [`values.go`](https://github.com/Lissy93/OLD_AdGuardian-Term/blob/main/values/values.go)\n\n---\n\n## License\n\n> _**[Lissy93/OLD_AdGuardian](https://github.com/Lissy93/OLD_AdGuardian)** is licensed under [MIT](https://github.com/Lissy93/OLD_AdGuardian/blob/master/LICENSE) Â© [Alicia Sykes](https://aliciasykes.com) 2022._\u003Cbr>\n> \u003Csup align=\"right\">For information, see \u003Ca href=\"https://tldrlegal.com/license/mit-license\">TLDR Legal > MIT\u003C/a>\u003C/sup>\n\n\u003Cdetails>\n\u003Csummary>Expand License\u003C/summary>\n\n```\nThe MIT License (MIT)\nCopyright (c) Alicia Sykes \u003Calicia@omg.com> \n\nPermission is hereby granted, free of charge, to any person obtaining a copy \nof this software and associated documentation files (the \"Software\"), to deal \nin the Software without restriction, including without limitation the rights \nto use, copy, modify, merge, publish, distribute, sub-license, and/or sell \ncopies of the Software, and to permit persons to whom the Software is furnished \nto do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included install \ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,\nINCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANT ABILITY, FITNESS FOR A\nPARTICULAR PURPOSE AND NON INFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT\nHOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION\nOF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE\nSOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n```\n\n\u003C/details>\n\n---\n\n\u003C!-- License + Copyright -->\n\u003Cp  align=\"center\">\n  \u003Ci>Â© \u003Ca href=\"https://aliciasykes.com\">Alicia Sykes\u003C/a> 2022\u003C/i>\u003Cbr>\n  \u003Ci>Licensed under \u003Ca href=\"https://gist.github.com/Lissy93/143d2ee01ccc5c052a17\">MIT\u003C/a>\u003C/i>\u003Cbr>\n  \u003Ca href=\"https://github.com/lissy93\">\u003Cimg src=\"https://i.ibb.co/4KtpYxb/octocat-clean-mini.png\" />\u003C/a>\u003Cbr>\n  \u003Csup>Thanks for visiting :)\u003C/sup>\n\u003C/p>\n\n\u003C!-- Dinosaur -->\n\u003C!-- \n                        . - ~ ~ ~ - .\n      ..     _      .-~               ~-.\n     //|     \\ `..~                      `.\n    || |      }  }              /       \\  \\\n(\\   \\\\ \\~^..'                 |         }  \\\n \\`.-~  o      /       }       |        /    \\\n (__          |       /        |       /      `.\n  `- - ~ ~ -._|      /_ - ~ ~ ^|      /- _      `.\n              |     /          |     /     ~-.     ~- _\n              |_____|          |_____|         ~ - . _ _~_-_\n-->\n\n",{"name":3,"title":25,"description":26,"icon":27,"screenshot":28,"color":29},"AdGuardian Term (V1)","A terminal-based traffic an DNS monitor for your AdGuard Home instance","https://storage.googleapis.com/as93-screenshots/project-logos/adguardian-go.png","https://storage.googleapis.com/as93-screenshots/project-screenshots/adguradian-go.png","#31d891"],"uses":{"params":["repo"]}}]}
